app/views/users/show.html.erb

    </div>
    <p><strong>Posts:</strong> <%= @user.microposts.count %></p>
---
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = ?  [["user_id", 250702083]]